lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/cores/nrf54l15/wiring_time.c
#if defined(NRF54L15_CLEAN_POWER_LOW)
#ifdef NRF_TRUSTZONE_NONSECURE
#define NRF54L15_CLEAN_GRTC_BASE 0x400E2000UL
#else
#define NRF54L15_CLEAN_GRTC_BASE 0x500E2000UL
#endif
static NRF_GRTC_Type* const g_low_power_grtc =
    (NRF_GRTC_Type*)NRF54L15_CLEAN_GRTC_BASE;
// On XIAO nRF54L15 secure CPUAPP, the Zephyr-derived allowed mask is 0x67
// (channels 0,1,2,5,6). Channel 5 is reserved here as the core's tickless
// wake source so delay() and delayLowPowerIdle() can sleep until deadline
// instead of waking every millisecond.
static const uint8_t kLowPowerDelayChannel = 5U;
static volatile uint8_t g_low_power_delay_fired = 0U;
static volatile uint8_t g_low_power_timebase_initialized = 0U;

static uint64_t readLowPowerCounterUs(void)
{
    for (uint8_t attempt = 0U; attempt < 32U; ++attempt) {
        const uint32_t hi0 = NRF54L15_GRTC_SYSCOUNTER(g_low_power_grtc).SYSCOUNTERH;
        const uint32_t lo = NRF54L15_GRTC_SYSCOUNTER(g_low_power_grtc).SYSCOUNTERL;
        const uint32_t hi1 = NRF54L15_GRTC_SYSCOUNTER(g_low_power_grtc).SYSCOUNTERH;

        if ((hi0 & GRTC_SYSCOUNTER_SYSCOUNTERH_BUSY_Msk) != 0U ||
            (hi1 & GRTC_SYSCOUNTER_SYSCOUNTERH_BUSY_Msk) != 0U ||
            (hi1 & GRTC_SYSCOUNTER_SYSCOUNTERH_OVERFLOW_Msk) != 0U) {
            continue;
        }

        const uint32_t high0 = hi0 & GRTC_SYSCOUNTER_SYSCOUNTERH_VALUE_Msk;
        const uint32_t high1 = hi1 & GRTC_SYSCOUNTER_SYSCOUNTERH_VALUE_Msk;
        if (high0 != high1) {
            continue;
        }

        return ((uint64_t)high0 << 32U) | (uint64_t)lo;
    }

    const uint32_t hi =
        NRF54L15_GRTC_SYSCOUNTER(g_low_power_grtc).SYSCOUNTERH &
        GRTC_SYSCOUNTER_SYSCOUNTERH_VALUE_Msk;
    const uint32_t lo = NRF54L15_GRTC_SYSCOUNTER(g_low_power_grtc).SYSCOUNTERL;
    return ((uint64_t)hi << 32U) | (uint64_t)lo;
}

static void lowPowerDisarmDelayWake(void)
{
    NRF54L15_GRTC_INTENCLR_REG(g_low_power_grtc) = (1UL << kLowPowerDelayChannel);
    g_low_power_grtc->CC[kLowPowerDelayChannel].CCEN =
        (GRTC_CC_CCEN_ACTIVE_Disable << GRTC_CC_CCEN_ACTIVE_Pos);
    g_low_power_grtc->EVENTS_COMPARE[kLowPowerDelayChannel] = 0U;
}

static void lowPowerArmDelayWake(uint64_t targetUs)
{
    const uint32_t lo = (uint32_t)(targetUs & 0xFFFFFFFFULL);
    const uint32_t hi = (uint32_t)((targetUs >> 32U) & 0xFFFFFUL);

    g_low_power_delay_fired = 0U;
    g_low_power_grtc->EVENTS_COMPARE[kLowPowerDelayChannel] = 0U;
    g_low_power_grtc->CC[kLowPowerDelayChannel].CCEN =
        (GRTC_CC_CCEN_ACTIVE_Disable << GRTC_CC_CCEN_ACTIVE_Pos);
    g_low_power_grtc->CC[kLowPowerDelayChannel].CCL = lo;
    g_low_power_grtc->CC[kLowPowerDelayChannel].CCH =
        (hi << GRTC_CC_CCH_CCH_Pos) & GRTC_CC_CCH_CCH_Msk;
    NVIC->ICPR[((uint32_t)kLowPowerTickIrq) >> 5U] =
        (1UL << (((uint32_t)kLowPowerTickIrq) & 0x1FUL));
    NRF54L15_GRTC_INTENSET_REG(g_low_power_grtc) = (1UL << kLowPowerDelayChannel);
    g_low_power_grtc->CC[kLowPowerDelayChannel].CCEN =
        (GRTC_CC_CCEN_ACTIVE_Enable << GRTC_CC_CCEN_ACTIVE_Pos);
}

static void initLowPowerTimebase(void)
{
    if (g_low_power_timebase_initialized != 0U) {
        return;
    }

    ensureSystemOffLfxoRunning();

    uint32_t clkcfg = g_low_power_grtc->CLKCFG;
    clkcfg &= ~GRTC_CLKCFG_CLKSEL_Msk;
    clkcfg |= (GRTC_CLKCFG_CLKSEL_LFXO << GRTC_CLKCFG_CLKSEL_Pos);
    g_low_power_grtc->CLKCFG = clkcfg;

    g_low_power_grtc->TIMEOUT =
        (((uint32_t)kLowPowerDelayTimeoutLfclk << GRTC_TIMEOUT_VALUE_Pos) &
         GRTC_TIMEOUT_VALUE_Msk);
    g_low_power_grtc->WAKETIME =
        (((uint32_t)kLowPowerDelayWakeLfclk << GRTC_WAKETIME_VALUE_Pos) &
         GRTC_WAKETIME_VALUE_Msk);
    g_low_power_grtc->MODE =
        (GRTC_MODE_AUTOEN_CpuActive << GRTC_MODE_AUTOEN_Pos) |
        (GRTC_MODE_SYSCOUNTEREN_Enabled << GRTC_MODE_SYSCOUNTEREN_Pos);
    g_low_power_grtc->TASKS_START = GRTC_TASKS_START_TASKS_START_Trigger;

    // GRTC state can survive in ways that matter across debug/program cycles.
    // Clear the whole interrupt/event group before using the low-power delay
    // channel, or a stale compare event on another channel can trap the CPU in
    // the IRQ.
    const uint32_t bleReservedMask =
        (nrf54l15_ble_grtc_reserved_cc_mask != 0)
            ? nrf54l15_ble_grtc_reserved_cc_mask()
            : 0U;
    NRF54L15_GRTC_INTENCLR_REG(g_low_power_grtc) =
        0xFFFFFFFFUL & ~bleReservedMask;
    for (uint8_t channel = 0; channel < GRTC_CC_MaxCount; ++channel) {
        if ((bleReservedMask & (1UL << channel)) != 0U) {
            continue;
        }
        g_low_power_grtc->CC[channel].CCEN =
            (GRTC_CC_CCEN_ACTIVE_Disable << GRTC_CC_CCEN_ACTIVE_Pos);
        g_low_power_grtc->EVENTS_COMPARE[channel] = 0U;
    }

    NVIC->ICPR[((uint32_t)kLowPowerTickIrq) >> 5U] =
        (1UL << (((uint32_t)kLowPowerTickIrq) & 0x1FUL));
    NVIC_SetPriority(kLowPowerTickIrq, 3U);
    NVIC_EnableIRQ(kLowPowerTickIrq);
    g_low_power_timebase_initialized = 1U;
}

void nrf54l15_core_bootstrap_low_power_timebase(void)
{
    initLowPowerTimebase();
}

static void delayUntilLowPowerCounterUs(uint64_t targetUs)
{
    if ((__get_PRIMASK() & 1U) != 0U) {
        while ((int64_t)(targetUs - readLowPowerCounterUs()) > 0) {
            nrf54l15_clean_idle_service();
            __NOP();
        }
        return;
    }

    while ((int64_t)(targetUs - readLowPowerCounterUs()) > 0) {
        nrf54l15_clean_idle_service();
        lowPowerArmDelayWake(targetUs);
        const uint32_t restoreRaw = beginIdleSleep();
        while ((g_low_power_delay_fired == 0U) &&
               ((int64_t)(targetUs - readLowPowerCounterUs()) > 0)) {
            __asm volatile("wfi");
        }
        endIdleSleep(restoreRaw);
        lowPowerDisarmDelayWake();
    }
}
#endif

#if NRF54L15_GRTC_IRQ_GROUP == 2U
void GRTC_2_IRQHandler(void)
#elif NRF54L15_GRTC_IRQ_GROUP == 1U
void GRTC_1_IRQHandler(void)
#else
void GRTC_0_IRQHandler(void)
#endif
{
#if defined(NRF54L15_CLEAN_POWER_LOW)
    if (g_low_power_grtc->EVENTS_COMPARE[kLowPowerDelayChannel] != 0U) {
        g_low_power_grtc->EVENTS_COMPARE[kLowPowerDelayChannel] = 0U;
        g_low_power_grtc->CC[kLowPowerDelayChannel].CCEN =
            (GRTC_CC_CCEN_ACTIVE_Disable << GRTC_CC_CCEN_ACTIVE_Pos);
        NRF54L15_GRTC_INTENCLR_REG(g_low_power_grtc) =
            (1UL << kLowPowerDelayChannel);
        g_low_power_delay_fired = 1U;
    }
#endif
    if (nrf54l15_ble_grtc_irq_service != 0) {
        nrf54l15_ble_grtc_irq_service();
    }
}

static uint8_t delayBoardStateEnter(xiao_nrf54l15_board_state_t* state)
{
#if defined(ARDUINO_XIAO_NRF54L15)
    if (state == 0 || xiaoNrf54l15SaveBoardState(state) == 0U) {
        return 0U;
    }

    xiaoNrf54l15EnterLowestPowerBoardState();
    return 1U;
#else
    (void)state;
    return 0U;
#endif
}

static void delayBoardStateExit(const xiao_nrf54l15_board_state_t* state, uint8_t active)
{
#if defined(ARDUINO_XIAO_NRF54L15)
    if (active != 0U) {
        (void)xiaoNrf54l15RestoreBoardState(state);
    }
#else
    (void)state;
    (void)active;
#endif
}

static uint8_t systemOffWakeChannel(void)
{
#if defined(ARDUINO_XIAO_NRF54L15)
    const uint32_t available =
        kZephyrAllowedCcMaskXiao & ~(1UL << kZephyrMainCcChannelXiao);
    return highestSetBit(available);
#else
    return 1U;
#endif
}

void nrf54l15_core_prepare_system_off_wake_timebase(void)
{
    NRF_GRTC_Type* const grtc = NRF_GRTC;
    NRF54L15_GRTC_INTENCLR_REG(grtc) = 0xFFFFFFFFUL;
    for (uint8_t channel = 0U; channel < GRTC_CC_MaxCount; ++channel) {
        grtc->CC[channel].CCEN =
            (GRTC_CC_CCEN_ACTIVE_Disable << GRTC_CC_CCEN_ACTIVE_Pos);
        grtc->EVENTS_COMPARE[channel] = 0U;
    }

