lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/cores/nrf54l15/wiring_time.c
    NRF54L15_GRTC_SYSCOUNTER(grtc).ACTIVE =
        (GRTC_SYSCOUNTER_ACTIVE_ACTIVE_NotActive <<
         GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Pos);
    __asm volatile("dsb 0xF" ::: "memory");
    grtc->TASKS_STOP = GRTC_TASKS_STOP_TASKS_STOP_Trigger;
    __asm volatile("dsb 0xF" ::: "memory");
    busyWaitApproxUs(kGrtcStartSettleUs);

#if defined(NRF54L15_CLEAN_POWER_LOW)
    if (g_low_power_timebase_initialized != 0U) {
        NVIC_DisableIRQ(kLowPowerTickIrq);
        NVIC->ICPR[((uint32_t)kLowPowerTickIrq) >> 5U] =
            (1UL << (((uint32_t)kLowPowerTickIrq) & 0x1FUL));
        g_low_power_delay_fired = 0U;
        g_low_power_timebase_initialized = 0U;
    }
#endif
}

static uint32_t systemOffMinimumLatencyUs(void)
{
    return ((((uint32_t)kSystemOffTimeoutLfclk +
              (uint32_t)kSystemOffWakeLeadLfclk) *
             1000000UL) /
            kSystemOffLfclkFrequencyHz) +
           kSystemOffMinimumLatencyGuardUs;
}

static uint32_t clampSystemOffDelayUs(uint32_t delayUs)
{
    const uint32_t minimumLatencyUs = systemOffMinimumLatencyUs();
    if (delayUs < minimumLatencyUs) {
        return minimumLatencyUs;
    }
    return delayUs;
}

static void configureSystemOffWakeSleep(NRF_GRTC_Type* grtc)
{
    uint32_t mode = grtc->MODE;
    mode &= ~(GRTC_MODE_AUTOEN_Msk | GRTC_MODE_SYSCOUNTEREN_Msk);
    mode |= (GRTC_MODE_AUTOEN_Default << GRTC_MODE_AUTOEN_Pos);
    mode |= (GRTC_MODE_SYSCOUNTEREN_Disabled << GRTC_MODE_SYSCOUNTEREN_Pos);
    grtc->MODE = mode;
    __asm volatile("dsb 0xF" ::: "memory");

    uint32_t clkcfg = grtc->CLKCFG;
    clkcfg &= ~GRTC_CLKCFG_CLKSEL_Msk;
    clkcfg |= (GRTC_CLKCFG_CLKSEL_LFXO << GRTC_CLKCFG_CLKSEL_Pos);
    grtc->CLKCFG = clkcfg;

    grtc->TIMEOUT = (((uint32_t)kSystemOffTimeoutLfclk << GRTC_TIMEOUT_VALUE_Pos) &
                     GRTC_TIMEOUT_VALUE_Msk);
    grtc->WAKETIME =
        (((uint32_t)kSystemOffWakeLeadLfclk << GRTC_WAKETIME_VALUE_Pos) &
         GRTC_WAKETIME_VALUE_Msk);

    mode &= ~GRTC_MODE_SYSCOUNTEREN_Msk;
    mode |= (GRTC_MODE_SYSCOUNTEREN_Enabled << GRTC_MODE_SYSCOUNTEREN_Pos);
    grtc->MODE = mode;
    __asm volatile("dsb 0xF" ::: "memory");
}

static void armSystemOffWakeCompare(NRF_GRTC_Type* grtc,
                                    uint8_t wakeChannel,
                                    uint64_t wakeTimestamp)
{
    grtc->EVENTS_COMPARE[wakeChannel] = 0U;
    grtc->CC[wakeChannel].CCEN =
        (GRTC_CC_CCEN_ACTIVE_Disable << GRTC_CC_CCEN_ACTIVE_Pos);
    grtc->CC[wakeChannel].CCL = (uint32_t)(wakeTimestamp & 0xFFFFFFFFULL);
    grtc->CC[wakeChannel].CCH =
        ((uint32_t)((wakeTimestamp >> 32U) & 0xFFFFFUL) <<
         GRTC_CC_CCH_CCH_Pos) &
        GRTC_CC_CCH_CCH_Msk;
    NRF54L15_GRTC_INTENSET_REG(grtc) = (1UL << wakeChannel);
    grtc->CC[wakeChannel].CCEN =
        (GRTC_CC_CCEN_ACTIVE_Enable << GRTC_CC_CCEN_ACTIVE_Pos);
}

static void waitForSystemOffWakeLatch(void)
{
    const uint32_t waitUs =
        ((uint32_t)kSystemOffTimeoutLfclk * 1000000UL) /
            kSystemOffLfclkFrequencyHz +
        kSystemOffMaxCcLatchWaitUs;
    delayMicroseconds(waitUs);
}

static void programSystemOffWakeUs(uint32_t delayUs)
{
    NRF_GRTC_Type* const grtc = NRF_GRTC;
    delayUs = clampSystemOffDelayUs(delayUs);

    nrf54l15_core_prepare_system_off_wake_timebase();
    ensureSystemOffLfxoRunning();
    configureSystemOffWakeSleep(grtc);

    const uint8_t wakeChannel = systemOffWakeChannel();
    for (uint8_t channel = 0U; channel < GRTC_CC_MaxCount; ++channel) {
        NRF54L15_GRTC_INTENCLR_REG(grtc) = (1UL << channel);
        if (channel != wakeChannel) {
            grtc->CC[channel].CCEN =
                (GRTC_CC_CCEN_ACTIVE_Disable << GRTC_CC_CCEN_ACTIVE_Pos);
        }
    }

    ensureGrtcReady(grtc);
    const uint32_t minimumLatencyUs = systemOffMinimumLatencyUs();
    uint32_t wakeDelayUs = delayUs;

    for (uint8_t attempt = 0U; attempt < 2U; ++attempt) {
        const uint64_t wakeTimestamp = readGrtcCounterUs(grtc) + wakeDelayUs;
        armSystemOffWakeCompare(grtc, wakeChannel, wakeTimestamp);
        waitForSystemOffWakeLatch();

        if (grtc->EVENTS_COMPARE[wakeChannel] == 0U) {
            return;
        }

        const uint64_t now = readGrtcCounterUs(grtc);
        if (wakeTimestamp > now) {
            grtc->EVENTS_COMPARE[wakeChannel] = 0U;
            return;
        }

        wakeDelayUs += minimumLatencyUs;
    }
}

static void enterTimedSystemOff(bool disableRamRetention, uint32_t delayUs)
{
    programSystemOffWakeUs(delayUs);
    nrf54l15_core_prepare_system_off();
    if (disableRamRetention) {
        nrf54l15_core_disable_system_off_retention();
    }

    __asm volatile("cpsid i" ::: "memory");
    __asm volatile("dsb 0xF" ::: "memory");
    __asm volatile("isb 0xF" ::: "memory");
    NRF_RESET->RESETREAS = 0xFFFFFFFFUL;
    __asm volatile("dsb 0xF" ::: "memory");

    NRF_REGULATORS->SYSTEMOFF = REGULATORS_SYSTEMOFF_SYSTEMOFF_Enter;
    __asm volatile("dsb 0xF" ::: "memory");
    while (true) {
        __asm volatile("wfe");
    }
}

void SysTick_Handler(void)
{
#if !defined(NRF54L15_CLEAN_POWER_LOW)
    ++g_millis_ticks;
#endif
}

void initSysTick(void)
{
    SystemCoreClockUpdate();

    uint32_t ticks = SystemCoreClock / 1000UL;
    if (ticks == 0UL) {
        ticks = 64000UL;
    }

    SysTick->CTRL = 0;
    SysTick->LOAD = ticks - 1UL;
    SysTick->VAL = 0UL;
#if !defined(NRF54L15_CLEAN_POWER_LOW)
    SysTick->CTRL = SysTick_CTRL_CLKSOURCE_Msk |
                    SysTick_CTRL_TICKINT_Msk |
                    SysTick_CTRL_ENABLE_Msk;
#endif
}

unsigned long millis(void)
{
#if defined(NRF54L15_CLEAN_POWER_LOW)
    initLowPowerTimebase();
    return (unsigned long)(readLowPowerCounterUs() / 1000ULL);
#else
    return (unsigned long)g_millis_ticks;
#endif
}

unsigned long micros(void)
{
#if defined(NRF54L15_CLEAN_POWER_LOW)
    initLowPowerTimebase();
    return (unsigned long)(uint32_t)readLowPowerCounterUs();
#else
    uint32_t ms_a;
    uint32_t ms_b;
    uint32_t val;
    uint32_t load;

    do {
        ms_a = g_millis_ticks;
        val = SysTick->VAL;
        ms_b = g_millis_ticks;
    } while (ms_a != ms_b);

    load = SysTick->LOAD + 1UL;
    uint32_t elapsed = load - val;
    uint32_t cycles_per_us = (SystemCoreClock == 0UL) ? 64UL : (SystemCoreClock / 1000000UL);
    if (cycles_per_us == 0UL) {
        cycles_per_us = 64UL;
    }

    return (unsigned long)(ms_a * 1000UL + (elapsed / cycles_per_us));
#endif
}

void delay(unsigned long ms)
{
#if defined(NRF54L15_CLEAN_POWER_LOW)
    if (ms == 0UL) {
        nrf54l15_clean_idle_service();
        return;
    }

    initLowPowerTimebase();
    const uint64_t targetUs = readLowPowerCounterUs() + ((uint64_t)ms * 1000ULL);
    // Keep plain delay() Arduino-compatible. Sketches may hold board-control
    // rails such as VBAT_EN or RF switch power high across the delay and
    // expect that state to remain asserted. delayLowPowerIdle() is the
    // explicit low-power helper that collapses and restores board state.
    delayUntilLowPowerCounterUs(targetUs);
#else
    const unsigned long start = millis();
    while ((millis() - start) < ms) {
        nrf54l15_clean_idle_service();
        __NOP();
    }
#endif
}

void delayLowPowerIdle(unsigned long ms)
{
    if (ms == 0UL) {
        nrf54l15_clean_idle_service();
        return;
    }

